_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_НастройкиВерсионированияОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_НастройкиВерсионированияОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛогинSQL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПарольSQL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверSQL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьПриЗаписи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьПриИзмененииПодчиненных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьПриПересчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьПриУтверждении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьРегламентно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокХраненияВерсий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СрокиХраненияВерсий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранитьВоВнешнейБазе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_ВерсииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_ВерсииОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВерсияОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвторВерсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВерсии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СрокиХраненияВерсий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СрокиХраненияВерсий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаПоследнююНеделю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаПоследнийМесяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаПоследниеТриМесяца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаПоследниеШестьМесяцев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаПоследнийГод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бессрочно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/CommonModules/СМ_ВерсионированиеСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Сметная подсистема".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура СМ_СохранятьСостояние() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	СМ_ЛокальнаяСмета.Ссылка
	                |ИЗ
	                |	Документ.СМ_ЛокальнаяСмета КАК СМ_ЛокальнаяСмета
	                |ГДЕ
	                |	НЕ СМ_ЛокальнаяСмета.ПометкаУдаления
	                |УПОРЯДОЧИТЬ ПО
	                |	СМ_ЛокальнаяСмета.МоментВремени";
	Выборка = Запрос.Выполнить().Выбрать();
		
	Настройки = РегистрыСведений.СМ_НастройкиВерсионированияОбъектов.Выбрать();
	Настройки.Следующий();

	Если Настройки.ХранитьВоВнешнейБазе Тогда
		ЗаписатьВерсииОбъектов(Выборка,Настройки);
	Иначе
		Пока Выборка.Следующий() Цикл
			ЗаписатьВерсиюОбъекта(Выборка.Ссылка,Настройки);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура СМ_ОчисткаИсторииСостояния() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	ГраницыУдаленияОбъектов = ГраницыУдаленияОбъектов();
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВерсииОбъектов.Объект,
	|	ВерсииОбъектов.НомерВерсии,
	|	ВерсииОбъектов.ИмяБазы
	|ИЗ
	|	РегистрСведений.СМ_ВерсииОбъектов КАК ВерсииОбъектов
	|ГДЕ
	|	&ДополнительныеУсловия";
	
	ДополнительныеУсловия = "
	|	ВерсииОбъектов.ДатаВерсии < &ГраницаУдаления";
	Запрос.УстановитьПараметр("ГраницаУдаления", ГраницыУдаленияОбъектов[0].ГраницаУдаления);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДополнительныеУсловия", ДополнительныеУсловия);
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.СМ_ВерсииОбъектов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Объект = Выборка.Объект;
		МенеджерЗаписи.НомерВерсии = Выборка.НомерВерсии;
		МенеджерЗаписи.ИмяБазы = Выборка.ИмяБазы;
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Удалить();
	КонецЦикла;
КонецПроцедуры

Функция ГраницыУдаленияОбъектов()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ГраницаУдаления", Новый ОписаниеТипов("Дата"));
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НастройкиВерсионированияОбъектов.СрокХраненияВерсий КАК СрокХраненияВерсий
	|ИЗ
	|	РегистрСведений.СМ_НастройкиВерсионированияОбъектов КАК НастройкиВерсионированияОбъектов
	|
	|УПОРЯДОЧИТЬ ПО
	|	СрокХраненияВерсий";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	ВыборкаОбъектов = Запрос.Выполнить().Выбрать();
	Если ВыборкаОбъектов.Следующий() Тогда
		СоответствиеГраницыТипамОбъектов = Результат.Добавить();
		СоответствиеГраницыТипамОбъектов.ГраницаУдаления = ГраницаУдаления(ВыборкаОбъектов.СрокХраненияВерсий);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ГраницаУдаления(СрокХраненияВерсий)
	Если СрокХраненияВерсий = Перечисления.СрокиХраненияВерсий.ЗаПоследнийГод Тогда
		Возврат ДобавитьМесяц(ТекущаяДатаСеанса(), -12);
	ИначеЕсли СрокХраненияВерсий = Перечисления.СрокиХраненияВерсий.ЗаПоследниеШестьМесяцев Тогда
		Возврат ДобавитьМесяц(ТекущаяДатаСеанса(), -6);
	ИначеЕсли СрокХраненияВерсий = Перечисления.СрокиХраненияВерсий.ЗаПоследниеТриМесяца Тогда
		Возврат ДобавитьМесяц(ТекущаяДатаСеанса(), -3);
	ИначеЕсли СрокХраненияВерсий = Перечисления.СрокиХраненияВерсий.ЗаПоследнийМесяц Тогда
		Возврат ДобавитьМесяц(ТекущаяДатаСеанса(), -1);
	ИначеЕсли СрокХраненияВерсий = Перечисления.СрокиХраненияВерсий.ЗаПоследнююНеделю Тогда
		Возврат ТекущаяДатаСеанса() - 7*24*60*60;
	Иначе // СрокХраненияВерсий = Перечисления.СрокиХраненияВерсий.Бессрочно
		Возврат '000101010000';
	КонецЕсли;
КонецФункции

Процедура ОбработатьОбъект(Объект,РежимЗаписи) Экспорт
	Если ПолучитьФункциональнуюОпцию("СМ_ХранитьИсториюИзмененияСмет")
		И Объект.ПометкаУдаления = Объект.Ссылка.ПометкаУдаления Тогда
		
		Настройки = РегистрыСведений.СМ_НастройкиВерсионированияОбъектов.Выбрать();
		Если Не Настройки.Следующий() Тогда
			Возврат;
		КонецЕсли;
		
		Если РежимЗаписи = РежимЗаписиДокумента.Запись
			И Настройки.СохранятьПриЗаписи Тогда
			Объект.ДополнительныеСвойства.Вставить("СохранятьПриЗаписи",Истина);
		ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Проведение
			И Настройки.СохранятьПриУтверждении Тогда
			Объект.ДополнительныеСвойства.Вставить("СохранятьПриУтверждении",Истина);
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

Функция СохранятьПриЗаписиПодчиненного() Экспорт
	Если ПолучитьФункциональнуюОпцию("СМ_ХранитьИсториюИзмененияСмет") Тогда
		
		Настройки = РегистрыСведений.СМ_НастройкиВерсионированияОбъектов.Выбрать();
		Если Не Настройки.Следующий() Тогда
			Возврат Ложь;
		Иначе
			Возврат Настройки.СохранятьПриИзмененииПодчиненных;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция СохранятьПриПересчете() Экспорт
	Если ПолучитьФункциональнуюОпцию("СМ_ХранитьИсториюИзмененияСмет") Тогда
		
		Настройки = РегистрыСведений.СМ_НастройкиВерсионированияОбъектов.Выбрать();
		Если Не Настройки.Следующий() Тогда
			Возврат Ложь;
		Иначе
			Возврат Настройки.СохранятьПриПересчете;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Процедура СМ_ЗаписатьВерсиюСметыПриЗаписи(Источник, Отказ) Экспорт
	Если Не Отказ И Источник.ДополнительныеСвойства.Свойство("СохранятьПриЗаписи") Тогда
		ЗаписатьВерсиюОбъекта(Источник.Ссылка);
	КонецЕсли;
КонецПроцедуры

Процедура СМ_ЗаписатьВерсиюСметыПроведениеОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если Не Отказ И Источник.ДополнительныеСвойства.Свойство("СохранятьПриУтверждении") Тогда
		ЗаписатьВерсиюОбъекта(Источник.Ссылка);
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписатьВерсииОбъектов(Выборка,Настройки) Экспорт
	Имя_базы = СтрокаСоединенияИнформационнойБазы();
	
	ServerName=СокрЛП(Настройки.СерверSQL);   // имя или IP-адрес сервера
	
	DSN=СокрЛП(Настройки.ИмяБазы);       // имя базы данных
	
	UID=СокрЛП(Настройки.ЛогинSQL);   // логин пользователя
	
	PWD=СокрЛП(Настройки.ПарольSQL);               // пароль
	
	ConnectString="Provider=SQLOLEDB;Data Source="+ServerName+";DatabaseName="+DSN+";Initial Catalog="+DSN+";UID="+UID+";PWD="+PWD;
	Соединение=Новый COMОбъект("ADODB.Connection");
	Соединение.ConnectionTimeOut=600;
	Попытка              
		Соединение.Open(ConnectString); 
	Исключение
		Событие = НСтр("ru = 'Запись версии смета в SQL'");
		ЗаписьЖурналаРегистрации(Событие,УровеньЖурналаРегистрации.Ошибка,,,НСтр("ru = 'Не удалось соединиться с базой данных!'"));
		Возврат;
	КонецПопытки;
	
	Cmd=Новый COMОбъект("ADODB.Command");
	Rs=Новый COMОбъект("ADODB.RecordSet");
	Cmd.ActiveConnection=Соединение;
	Cmd.CommandTimeOut=600;
	Cmd.CommandType=1;   //запрос на языке SQL
	Rs.ActiveConnection=Соединение;
	
	Пока Выборка.Следующий() Цикл
		Ссылка = Выборка.Ссылка;
		ДанныеВерсии = ДанныеДляХранения(Ссылка);
		СтрокаДанных = Base64Строка(ДанныеВерсии);
		КонтрольнаяСумма = КонтрольнаяСумма(ДанныеВерсии);
		НомерВерсии = НомерПоследнейВерсии(Ссылка)+1;
		ТекстЗапроса = "INSERT INTO [dbo].[LocalSmets]
		|([Smeta]
		|,[Numvers]
		|,[Version]
		|,[Date]
		|,[Summ]
		|,[Name_db])
		|VALUES (#смета#, #номер#, '#версия#', '#дата#', '#контроль#', '#имя_базы#')";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#смета#",ПолучитьGUIDПоУИД(Ссылка.УникальныйИдентификатор()));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#номер#",НомерВерсии);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#версия#",СтрокаДанных);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#дата#",ТекущаяДатаСеанса());
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#контроль#",КонтрольнаяСумма);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#имя_базы#",Имя_базы);
		
		Cmd.Commandtext=СокрЛП(ТекстЗапроса);
		
		Попытка
			Rs=Cmd.Execute();
		Исключение
			ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Событие = НСтр("ru = 'Запись версии смета в SQL'");
			ЗаписьЖурналаРегистрации(Событие,УровеньЖурналаРегистрации.Ошибка,,,ПредставлениеОшибки);
			Возврат;
		КонецПопытки;
		МенеджерЗаписи = РегистрыСведений.СМ_ВерсииОбъектов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Объект = Ссылка;
		МенеджерЗаписи.ИмяБазы = Имя_базы;
		МенеджерЗаписи.НомерВерсии = НомерВерсии;
		МенеджерЗаписи.АвторВерсии = Пользователи.ТекущийПользователь();
		МенеджерЗаписи.ДатаВерсии = ТекущаяДатаСеанса();
		МенеджерЗаписи.КонтрольнаяСумма = КонтрольнаяСумма;
		МенеджерЗаписи.Записать(Ложь);
	КонецЦикла;

КонецПроцедуры

Процедура ЗаписатьВерсиюОбъекта(Ссылка,Настройки = Неопределено,Комментарий = "") Экспорт
	
	Если Настройки = Неопределено Тогда
		Настройки = РегистрыСведений.СМ_НастройкиВерсионированияОбъектов.Выбрать();
		Настройки.Следующий();
	КонецЕсли;	
	
	Имя_базы = СтрокаСоединенияИнформационнойБазы();
	Если Настройки.ХранитьВоВнешнейБазе <> Неопределено И Настройки.ХранитьВоВнешнейБазе Тогда
	//Если Настройки.ХранитьВоВнешнейБазе Тогда
	
		ServerName=СокрЛП(Настройки.СерверSQL);   // имя или IP-адрес сервера
		
		DSN=СокрЛП(Настройки.ИмяБазы);       // имя базы данных
		
		UID=СокрЛП(Настройки.ЛогинSQL);   // логин пользователя
		
		PWD=СокрЛП(Настройки.ПарольSQL);               // пароль
		
		ConnectString="Provider=SQLOLEDB;Data Source="+ServerName+";DatabaseName="+DSN+";Initial Catalog="+DSN+";UID="+UID+";PWD="+PWD;
		Соединение=Новый COMОбъект("ADODB.Connection");
		Соединение.ConnectionTimeOut=600;
		Попытка              
			Соединение.Open(ConnectString); 
		Исключение
			Событие = НСтр("ru = 'Запись версии смета в SQL'");
			ЗаписьЖурналаРегистрации(Событие,УровеньЖурналаРегистрации.Ошибка,,,НСтр("ru = 'Не удалось соединиться с базой данных!'"));
			Возврат;
		КонецПопытки;
		
		Cmd=Новый COMОбъект("ADODB.Command");
		Rs=Новый COMОбъект("ADODB.RecordSet");
		Cmd.ActiveConnection=Соединение;
		Cmd.CommandTimeOut=600;
		Cmd.CommandType=1;   //запрос на языке SQL
		
		ДанныеВерсии = ДанныеДляХранения(Ссылка);
		СтрокаДанных = Base64Строка(ДанныеВерсии);
		КонтрольнаяСумма = КонтрольнаяСумма(ДанныеВерсии);
		
		ТекстЗапроса = "INSERT INTO [dbo].[LocalSmets]
		|([Smeta]
		|,[Numvers]
		|,[Version]
		|,[Date]
		|,[Summ]
		|,[Name_db])
		|VALUES (#смета#, #номер#, '#версия#', '#дата#', '#контроль#', '#имя_базы#')";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#смета#",ПолучитьGUIDПоУИД(Ссылка.УникальныйИдентификатор()));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#номер#",НомерПоследнейВерсии(Ссылка)+1);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#версия#",СтрокаДанных);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#дата#",ТекущаяДатаСеанса());
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#контроль#",КонтрольнаяСумма);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#имя_базы#",Имя_базы);
		
		Cmd.Commandtext=СокрЛП(ТекстЗапроса);
		
		Попытка
			Rs.ActiveConnection=Соединение;
			Rs=Cmd.Execute();
		Исключение
			ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Событие = НСтр("ru = 'Запись версии смета в SQL'");
			ЗаписьЖурналаРегистрации(Событие,УровеньЖурналаРегистрации.Ошибка,,,ПредставлениеОшибки);
			Возврат;
		КонецПопытки;
		МенеджерЗаписи = РегистрыСведений.СМ_ВерсииОбъектов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Объект = Ссылка;
		МенеджерЗаписи.ИмяБазы = Имя_базы;
		МенеджерЗаписи.НомерВерсии = НомерПоследнейВерсии(Ссылка)+1;
		МенеджерЗаписи.АвторВерсии = Пользователи.ТекущийПользователь();
		МенеджерЗаписи.ДатаВерсии = ТекущаяДатаСеанса();
		МенеджерЗаписи.КонтрольнаяСумма = КонтрольнаяСумма;
		МенеджерЗаписи.Комментарий = Комментарий;
		МенеджерЗаписи.Записать(Ложь);
	Иначе
		ДанныеВерсии 					= ДанныеДляХранения(Ссылка);
		КонтрольнаяСумма 				= КонтрольнаяСумма(ДанныеВерсии);
		МенеджерЗаписи 					= РегистрыСведений.СМ_ВерсииОбъектов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Объект 			= Ссылка;
		МенеджерЗаписи.ИмяБазы 			= Имя_базы;
		МенеджерЗаписи.НомерВерсии 		= НомерПоследнейВерсии(Ссылка)+1;
		МенеджерЗаписи.ВерсияОбъекта 	= Новый ХранилищеЗначения(ДанныеВерсии, Новый СжатиеДанных(9));
		МенеджерЗаписи.АвторВерсии 		= Пользователи.ТекущийПользователь();
		МенеджерЗаписи.ДатаВерсии 		= ТекущаяДатаСеанса();
		МенеджерЗаписи.КонтрольнаяСумма = КонтрольнаяСумма;
		МенеджерЗаписи.Комментарий 		= Комментарий;
		МенеджерЗаписи.Записать(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Функция ВосстановитьОбъект(Ссылка,ВерсияОбъекта,Удалять) Экспорт
	
	Если Удалять Тогда
		Таблица = СМ_СметаВызовСервера.ПолучитьТаблицуПодчиненных(Ссылка, Истина, Ложь);
		Для Каждого СтрокаИД Из Таблица Цикл
			См_СметаВызовСервера.УдалитьПозициюЛС(СтрокаИД.ИД, Ложь);
			//Смета = СтрокаИД.ИД.ПолучитьОбъект(); 
			//Смета.УстановитьПометкуУдаления(Истина);
			//См_СметаВызовСервера.УдалитьДвижения(Ссылка);
			//УдалениеСметы(Ссылка);
		КонецЦикла;
	КонецЕсли;

	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ВерсияОбъекта.Записать(ИмяВременногоФайла);
	Обработка = Обработки.СМ_ОбменДаннымиСмета3_0.Создать();
	ТЗЗагрузки = Новый ТаблицаЗначений;
	ТЗЗагрузки.Колонки.Добавить("Ссылка");
	Обработка.ЗагрузитьДокументы(ИмяВременногоФайла,ТЗЗагрузки,Истина,Ссылка,Истина);
	
	//НоваяСмета = ТЗЗагрузки[0].Ссылка;
	//
	//Если Удалять Тогда
	//	Смета = Ссылка.ПолучитьОбъект(); 
	//	Смета.УстановитьПометкуУдаления(Истина);
	//	См_СметаВызовСервера.УдалитьДвижения(Ссылка);
	//	УдалениеСметы(Ссылка);
	//КонецЕсли;

	Возврат Ссылка;
	
КонецФункции

Процедура УдалениеСметы(ОбъектУдаления) Экспорт
	
    УстановитьПривилегированныйРежим(Истина);
	
    МассивКУдалению = Новый Массив;
	
	НайтиПоСсылкамРекурсия(ОбъектУдаления,МассивКУдалению);
	
	УдалитьОбъекты(МассивКУдалению,Ложь);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура НайтиПоСсылкамРекурсия(Ссылка,МассивКУдалению)
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(Ссылка);
	ТабСсылок = НайтиПоСсылкам(МассивСсылок);
	
	Для Каждого СтрСсылка из ТабСсылок Цикл
		Если ТипЗнч(СтрСсылка.Данные) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета")
			ИЛИ ТипЗнч(СтрСсылка.Данные) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда
			Возврат;
		ИначеЕсли ТипЗнч(СтрСсылка.Данные) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета")
			И СтрСсылка.Данные <> СтрСсылка.Ссылка Тогда
			Если ЗначениеЗаполнено(СтрСсылка.Данные.КорректируетСмету) Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	Если МассивКУдалению.Найти(Ссылка) = Неопределено Тогда
		МассивКУдалению.Добавить(Ссылка);
	КонецЕсли;
	
	Для Каждого СтрСсылка из ТабСсылок Цикл
		Если Лев(СтрСсылка.Метаданные.ПолноеИмя(),15) = "РегистрСведений"
			ИЛИ Лев(СтрСсылка.Метаданные.ПолноеИмя(),10) = "ПланОбмена" Тогда
			Продолжить;
		КонецЕсли;
		Если СтрСсылка.Данные = СтрСсылка.Ссылка Тогда
			Продолжить;
		КонецЕсли;
		Если Не МассивКУдалению.Найти(СтрСсылка.Данные) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Об = СтрСсылка.Данные.ПолучитьОбъект();
		Об.УстановитьПометкуУдаления(Истина);
		МассивКУдалению.Добавить(СтрСсылка.Данные);
		НайтиПоСсылкамРекурсия(СтрСсылка.Данные,МассивКУдалению);
	КонецЦикла;
КонецПроцедуры

// Возвращает номер последней записанной версии объекта.
//
// Параметры:
//  Ссылка - ЛюбаяСсылка - ссылка на объект информационной базы.
//
// Возвращаемое значение:
//  Число - номер версии объекта.
//
Функция НомерПоследнейВерсии(Ссылка) Экспорт
	
	Если Ссылка.Пустая() Тогда
		Возврат 0;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(ВерсииОбъектов.НомерВерсии), 0) КАК НомерВерсии
	|ИЗ
	|	РегистрСведений.СМ_ВерсииОбъектов КАК ВерсииОбъектов
	|ГДЕ
	|	ВерсииОбъектов.Объект = &Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.НомерВерсии;
	
КонецФункции

// Возвращает структуру, содержащую версию объекта и дополнительную информацию.
//
// Параметры:
//  Ссылка      - Ссылка - ссылка версионируемый объект;
//  НомерВерсии - Число  - номер версии объекта.
//
// Возвращаемое значение - Структура:
//                          ВерсияОбъекта - ДвоичныеДанные - сохраненная версия объекта информационной базы;
//                          АвторВерсии   - Справочник.Пользователи, Справочник.ВнешниеПользователи - 
//                                          пользователь, записавший версию объекта.
//                          ДатаВерсии    - Дата - дата записи версии объекта.
// 
// Примечание:
//  Функция может вызвать исключение, если запись не содержит данных.
//  Функцию требуется вызвать в привилегированном режиме.
//
Функция СведенияОВерсииОбъекта(Ссылка, НомерВерсии, КонтрольнаяСумма,Имя_базы = "") Экспорт
	СообщениеНеУдалосьПолучитьВерсию = НСтр("ru = 'Не удалось получить выбранную версию объекта.'");
	
	// Если Число(НомерВерсии) = НомерПоследнейВерсии(Ссылка) Тогда
	//	ВызватьИсключение НСтр("ru = 'Выбранная версия является текущей.'");
	// КонецЕсли;

	Если ПустаяСтрока(Имя_базы) Тогда
		Имя_базы = СтрокаСоединенияИнформационнойБазы();
	КонецЕсли;
	
	Настройки = РегистрыСведений.СМ_НастройкиВерсионированияОбъектов.Выбрать();
	Настройки.Следующий();

	Если Настройки.ХранитьВоВнешнейБазе <> Неопределено И Настройки.ХранитьВоВнешнейБазе Тогда
//	Если Настройки.ХранитьВоВнешнейБазе Тогда
		
		ServerName=СокрЛП(Настройки.СерверSQL);   // имя или IP-адрес сервера
		
		DSN=СокрЛП(Настройки.ИмяБазы);       // имя базы данных
		
		UID=СокрЛП(Настройки.ЛогинSQL);   // логин пользователя
		
		PWD=СокрЛП(Настройки.ПарольSQL);               // пароль
		
		ConnectString="Provider=SQLOLEDB;Data Source="+ServerName+";DatabaseName="+DSN+";Initial Catalog="+DSN+";UID="+UID+";PWD="+PWD;
		Соединение=Новый COMОбъект("ADODB.Connection");
		Соединение.ConnectionTimeOut=600;
		Попытка              
			Соединение.Open(ConnectString); 
		Исключение
			ВызватьИсключение НСтр("ru = 'Не удалось соединиться с базой данных!'");
		КонецПопытки;
		
		Cmd=Новый COMОбъект("ADODB.Command");
		Rs=Новый COMОбъект("ADODB.RecordSet");
		Cmd.ActiveConnection=Соединение;
		Cmd.CommandTimeOut=600;
		Cmd.CommandType=1;   //запрос на языке SQL
		
		ТекстЗапроса = "SELECT [Smeta]
		|,[Numvers]
		|,[Version]
		|,[Date]
		|,[Summ]
		|,[Name_db]
		|FROM [dbo].[LocalSmets]
		|WHERE ((([dbo].[LocalSmets].Smeta = #смета#) AND ([dbo].[LocalSmets].Numvers = #номер#) AND ([dbo].[LocalSmets].Summ = '#контроль#') AND ([dbo].[LocalSmets].Name_db = '#имя_базы#')))";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#смета#",ПолучитьGUIDПоУИД(Ссылка.УникальныйИдентификатор()));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#номер#",НомерВерсии);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#контроль#",КонтрольнаяСумма);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#имя_базы#",Имя_базы);
		
		Cmd.Commandtext=СокрЛП(ТекстЗапроса);
		
		Попытка
			Rs.ActiveConnection=Соединение;
			Rs=Cmd.Execute();
		Исключение
			ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ВызватьИсключение ПредставлениеОшибки;
		КонецПопытки;
		
		Если Rs.EOF() Тогда
			ВызватьИсключение СообщениеНеУдалосьПолучитьВерсию;
		КонецЕсли;
		
		мСтруктура = Новый Структура;
		мПоля = Rs.Fields.Count - 1;
		Rs.MoveFirst();
		
		Для сч = 0 По мПоля Цикл
			мСтруктура.Вставить(Rs.Fields(сч).Name, Rs.Fields(сч).Value);
		КонецЦикла; 
		
		Результат = Новый Структура("ВерсияОбъекта, АвторВерсии, ДатаВерсии, Комментарий");
		Результат.ВерсияОбъекта = Base64Значение(мСтруктура.Version);
		Результат.ДатаВерсии = мСтруктура.Date;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВерсииОбъектов.АвторВерсии КАК АвторВерсии,
		|	ВерсииОбъектов.ДатаВерсии КАК ДатаВерсии,
		|	ВерсииОбъектов.Комментарий КАК Комментарий,
		|	ВерсииОбъектов.ВерсияОбъекта,
		|	ВерсииОбъектов.КонтрольнаяСумма
		|ИЗ
		|	РегистрСведений.СМ_ВерсииОбъектов КАК ВерсииОбъектов
		|ГДЕ
		|	ВерсииОбъектов.Объект = &Ссылка
		|	И ВерсииОбъектов.НомерВерсии = &НомерВерсии
		|	И ВерсииОбъектов.КонтрольнаяСумма = &КонтрольнаяСумма";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("НомерВерсии", Число(НомерВерсии));
		Запрос.УстановитьПараметр("КонтрольнаяСумма", КонтрольнаяСумма);
		
		Результат = Новый Структура("ВерсияОбъекта, АвторВерсии, ДатаВерсии, Комментарий");
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Результат, Выборка);
			Результат.ВерсияОбъекта = Результат.ВерсияОбъекта.Получить();
		КонецЕсли;
	КонецЕсли;
	
	Если Результат.ВерсияОбъекта = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Выбранная версия объекта отсутствует в программе.'");
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

// Возвращает двоичные данные.
//
// Параметры:
//  СсылкаНаОбъект - ЛюбаяСсылка - ссылка на объект информационной базы.
//
// Возвращаемое значение:
//  Результат - двоичные данные.
//
Функция ДанныеДляХранения(СсылкаНаОбъект) Экспорт
	Результат = "";
	Обработка = Обработки.СМ_ОбменДаннымиСмета3_0.Создать();
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ТаблицаВыгрузки = Новый ТаблицаЗначений;
	ТаблицаВыгрузки.Колонки.Добавить("Документ");
	ТаблицаВыгрузки.Колонки.Добавить("Сортировка");
	ТаблицаВыгрузки.Колонки.Добавить("ИдРодителя");
	ТаблицаВыгрузки.Колонки.Добавить("НаименованиеАрхива");
	ТаблицаВыгрузки.Колонки.Добавить("ДокументАрхива");
	Обработка.ВыгрузитьДокументы(СсылкаНаОбъект, ТаблицаВыгрузки, Неопределено, Неопределено, Неопределено,Результат,ИмяВременногоФайла,Истина);
	Возврат Результат;
	
КонецФункции

Функция РазмерДанных(Данные) Экспорт
	Возврат Base64Значение(СериализаторXDTO.XMLСтрока(Данные)).Размер();
КонецФункции

// Контрольная сумма по алгоритму MD5.
Функция КонтрольнаяСумма(Данные) Экспорт
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
	
	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		ХешированиеДанных.Добавить(Данные.Объект);
		Если Данные.Свойство("ДополнительныеРеквизиты") Тогда
			ХешированиеДанных.Добавить(ОбщегоНазначения.ЗначениеВСтрокуXML(Данные.ДополнительныеРеквизиты));
		КонецЕсли;
	Иначе
		ХешированиеДанных.Добавить(Данные);
	КонецЕсли;
	
	Возврат СтрЗаменить(ХешированиеДанных.ХешСумма, " ", "");
КонецФункции

// Преобразует строку УИДа в строку GUID'а
//
Функция ПолучитьGUIDПоУИД(Знач УИД) Экспорт
    
    УИД_0 = СтрЗаменить(УИД, "-", "");
    GUID  = "0x" + ВРег(Сред(УИД_0, 17, 4) + Прав(УИД_0, 12) + Сред(УИД_0, 13, 4) + Сред(УИД_0, 9, 4) + Лев(УИД_0, 8));
        
    Возврат GUID; 
    
КонецФункции

// Преобразует строку GUID'а в строку УИДа
//
Функция ПолучитьУИДПоGUID(Знач GUID) Экспорт
    
    GUID = Прав(GUID, СтрДлина(GUID) - 2);
    УИД = НРег(Строка(Прав(GUID, 8) + "-" + Сред(GUID, 21, 4) + "-" + Сред(GUID, 17, 4) + "-" + Лев(GUID, 4)  + "-" + Сред(GUID, 5, 12)));
    
    Возврат УИД;
    
КонецФункции 

Функция РазборВерсии(Ссылка, НомерВерсии,Записывать = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВерсииОбъектов.АвторВерсии КАК АвторВерсии,
	|	ВерсииОбъектов.ДатаВерсии КАК ДатаВерсии,
	|	ВерсииОбъектов.Комментарий КАК Комментарий,
	|	ВерсииОбъектов.ВерсияОбъекта,
	|	ВерсииОбъектов.КонтрольнаяСумма,
	|	ВерсииОбъектов.ИмяБазы
	|ИЗ
	|	РегистрСведений.СМ_ВерсииОбъектов КАК ВерсииОбъектов
	|ГДЕ
	|	ВерсииОбъектов.Объект = &Ссылка
	|	И ВерсииОбъектов.НомерВерсии = &НомерВерсии";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НомерВерсии", Число(НомерВерсии));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СведенияОВерсии = СведенияОВерсииОбъекта(Ссылка, НомерВерсии, Выборка.КонтрольнаяСумма,Выборка.ИмяБазы);
	Иначе
		ВызватьИсключение НСтр("ru = 'Выбранная версия объекта отсутствует в программе.'");
	КонецЕсли;

	Результат = ПолучитьПредставлениеОбъектаXML(Ссылка,СведенияОВерсии.ВерсияОбъекта,Записывать);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПредставлениеОбъектаXML(Ссылка,ДанныеВерсии,Записывать) Экспорт
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ДанныеВерсии.Записать(ИмяВременногоФайла);
	Обработка = Обработки.СМ_ОбменДаннымиСмета3_0.Создать();
	
	ТаблицаДанных = Обработка.ЗагрузитьОбразыДокументов(ИмяВременногоФайла,Записывать);

	Возврат ТаблицаДанных;
КонецФункции

#КонецОбласти
